//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   MoveBlock.cpp
//!
//! @brief  挟むギミックのソースファイル
//!
//! @date   2017/04/07		
//!
//! @author 渡邊真人
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

//ヘッダファイルの読込
#include "MoveBlock.h"


//関数の定義＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝＝－
//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Moveblock::Moveblock()
{
	g_gimmickimage = new Texture(L"Resources\\Images\\orange.png");

	m_handle = g_gimmickimage;
	m_grp_x = 0;
	m_grp_y = 0;
	m_grp_w = M_BLOCK_GRP_W;
	m_grp_h = M_BLOCK_GRP_H;
	m_pos_x = M_BLOCK_POS_X;
	m_pos_y = 0;
}

//----------------------------------------------------------------------
//! @brief デストラクタ
//!
//----------------------------------------------------------------------
Moveblock::~Moveblock()
{
	delete g_gimmickimage;
}


//----------------------------------------------------------------------
//! @brief ギミックの上下移動
//!
//! @return なし
//----------------------------------------------------------------------
void Moveblock::MoveUpDown()
{
	if (m_pos_y_min == m_pos_y)
	{
		SetSpdY(6);
	}
	else if (m_pos_y_max == m_pos_y)
	{
		SetSpdY(-6);
	}
}


