//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   Switch.cpp
//!
//! @brief  スイッチのソースファイル
//!
//! @date   2017/04/09		
//!
//! @author 渡邊真人
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

//ヘッダファイルのインクルード
#include "Switch.h"

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Switch::Switch(int pos_x, int pos_y)
{
	m_handle  = new Texture(L"Resources\\Images\\switch.png");
	m_grp_x = 0;
	m_grp_y = 0;
	m_grp_w = M_SWTICH_GRP;
	m_grp_h = M_SWTICH_GRP;
	m_pos_x = pos_x;
	m_pos_y = pos_y;
	m_state = false;
}

//----------------------------------------------------------------------
//! @brief デストラクタ
//!
//----------------------------------------------------------------------
Switch::~Switch()
{
	delete m_handle;
	m_handle = nullptr;
}

//----------------------------------------------------------------------
//! @brief スイッチのオンオフの切り替え
//!
//! @return なし
//----------------------------------------------------------------------
void Switch::Swtiching()
{
	m_grp_x = M_SWTICH_GRP;
}

