//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   WInd.cpp
//!
//! @brief  スイッチのソースファイル
//!
//! @date   2017/04/10	
//!
//! @author 渡邊真人
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

//ヘッダファイルのインクルード
#include "Wind.h"

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
Wind::Wind(int pos_x, int pos_y)
{
	m_handle = new Texture(L"Resources\\Images\\PongImage.png");
	m_grp_x = M_WIND_GRP;
	m_grp_y = 0;
	m_grp_w = M_WIND_GRP;
	m_grp_h = M_WIND_GRP;
	m_pos_x = pos_x;
	m_pos_y = pos_y;
}

//----------------------------------------------------------------------
//! @brief デストラクタ
//!
//----------------------------------------------------------------------
Wind::~Wind()
{
	delete m_handle;
	m_handle = nullptr;
}