//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   Press.cpp
//!
//! @brief  プレス機処理のソースファイル
//!
//! @date   2017/04/08
//!
//! @author 佐久間尚輝
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

#include "Press.h"

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] x座標、y座標
//----------------------------------------------------------------------
Press::Press(int pos_x, int pos_y)
	:m_count(0)			//カウント
{
	m_handle = new Texture(L"Resources\\Images\\Press.png");	//画像
	m_pos_x = pos_x;	//x座標
	m_pos_y = pos_y;	//y座標
	m_grp_x = 0;		//元画像のgrp_x
	m_grp_y = 0;		//元画像のgrp_y
	m_grp_w = PRESS_GRP_W;		//元画像のgrp_w
	m_grp_h = PRESS_GRP_H;		//元画像のgrp_h
}

//----------------------------------------------------------------------
//! @brief デストラクタ
//----------------------------------------------------------------------
Press::~Press()
{
	delete m_handle;	//画像
}

//----------------------------------------------------------------------
//! @brief 移動
//!
//! @param[in] なし
//!
//! @return なし
//----------------------------------------------------------------------
void Press::Move()
{
	m_count++;
	//下移動
	if (m_count < MOVE_COUNT / 2)
		m_spd_y = 1.0f;
	//上移動
	if (m_count > MOVE_COUNT / 2)
		m_spd_y = -1.0f;
	//reset
	if (m_count >= MOVE_COUNT)
		m_count = 0;

}