//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/
//! @file   Water.cpp
//!
//! @brief  水の処理のソースファイル
//!
//! @date   2017/04/10
//!
//! @author 加藤 竜哉
//__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/__/

//	ヘッダファイルのインクルード
#include "Water.h"

//----------------------------------------------------------------------
//! @brief コンストラクタ
//!
//! @param[in] なし
//----------------------------------------------------------------------
Water::Water(int pos_x, int pos_y)
{
	m_handle = new Texture(L"Resources\\Images\\water.png");	//画像
	m_pos_x = pos_x;			//x座標
	m_pos_y = pos_y;			//y座標
	m_grp_x = 0;				//元画像のgrp_x
	m_grp_y = 0;				//元画像のgrp_y
	m_grp_w = WATER_GRP_W;		//元画像のgrp_w
	m_grp_h = WATER_GRP_H;		//元画像のgrp_h
	m_state = false;
}

//----------------------------------------------------------------------
//! @brief デストラクタ
//----------------------------------------------------------------------
Water::~Water()
{
	delete m_handle;
	m_handle = nullptr;
}